app/controllers/users_controller.rb

	def show
		@user = User.find(params[:id])
---
SELECT * FROM "users" WHERE ("users"."id" = 1)

	def new
		@titre = "IInscription"
		#User.create!(:nom => "Utilisateur exemple", :email => "user@example.com", :password => "foobar", :password_confirmation => "foobar")
		user = User.find_by_email("mhartl@example.com")
---
SELECT "users".id FROM "users" WHERE (LOWER("users"."email") = 'mhartl@example.com') LIMIT 1